[
    {
      "title": "A.k.a. Cassius Clay",
      "year": 1970,
      "cast": [
        "Muhammad Ali"
      ],
      "genres": [
        "Documentary",
        "Sports"
      ],
      "href": "A.k.a._Cassius_Clay",
      "extract": "A.k.a. Cassius Clay is a 1970 boxing documentary film about the former heavyweight champion Muhammad Ali.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/17/Film_Poster_for_a.k.a._Cassius_Clay.jpg",
      "thumbnail_width": 264,
      "thumbnail_height": 376
    },
    {
      "title": "Adam at Six A.M.",
      "year": 1970,
      "cast": [
        "Michael Douglas",
        "Lee Purcell",
        "Joe Don Baker",
        "Louise Latham"
      ],
      "genres": [
        "Drama"
      ],
      "href": "Adam_at_Six_A.M.",
      "extract": "Adam at 6 A.M. is a 1970 American drama film directed by Robert Scheerer. It stars Michael Douglas, Lee Purcell, Joe Don Baker, Louise Latham, Charles Aidman, Grayson Hall, Marge Redmond, and Dana Elcar. The film did not receive much attention when it was released. The film was filmed almost entirely on location in the small Midwest town of Excelsior Springs, Missouri, as well as Cameron, Missouri and Orrick, Missouri.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/43/AdamAtSixAM1970Poster.jpg",
      "thumbnail_width": 256,
      "thumbnail_height": 389
    },
    {
      "title": "Adam's Woman",
      "year": 1970,
      "cast": [
        "Beau Bridges",
        "Jane Merrow",
        "John Mills",
        "James Booth"
      ],
      "genres": [
        "Historical",
        "Drama"
      ],
      "href": "Adam%27s_Woman",
      "extract": "Adam's Woman is a 1970 Australian-American historical drama film directed by Philip Leacock and starring Beau Bridges, Jane Merrow and John Mills. It has been called a \"convict Western\".",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/85/Adam%27s_Woman.jpg",
      "thumbnail_width": 264,
      "thumbnail_height": 376
    },
    {
      "title": "The Adventurers",
      "year": 1970,
      "cast": [
        "Bekim Fehmiu",
        "Candice Bergen",
        "Charles Aznavour",
        "Olivia de Havilland"
      ],
      "genres": [
        "Drama",
        "Adventure"
      ],
      "href": "The_Adventurers_(1970_film)",
      "extract": "The Adventurers is a 1970 American adventure drama film directed, produced, and co-written by Lewis Gilbert. It is based on the 1966 novel of the same name by Harold Robbins.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/1c/The_Adventurers_-_1970_-_poster.png",
      "thumbnail_width": 256,
      "thumbnail_height": 390
    },
    {
      "title": "Airport",
      "year": 1970,
      "cast": [
        "Burt Lancaster",
        "Dean Martin",
        "Jean Seberg",
        "Jacqueline Bisset",
        "Maureen Stapleton",
        "Van Heflin",
        "George Kennedy",
        "Helen Hayes",
        "Lloyd Nolan",
        "Dana Wynter",
        "Barbara Hale"
      ],
      "genres": [
        "Disaster",
        "Drama"
      ],
      "href": "Airport_(1970_film)",
      "extract": "Airport is a 1970 American air disaster–drama film written and directed by George Seaton and starring Burt Lancaster and Dean Martin. Based on Arthur Hailey's 1968 novel of the same name, it originated the 1970s disaster film genre. It is also the first of four films in the Airport film series. Produced on a $10 million budget, it earned over $128 million.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/4f/Airport_film.jpg",
      "thumbnail_width": 255,
      "thumbnail_height": 390
    },
    {
      "title": "Alex in Wonderland",
      "year": 1970,
      "cast": [
        "Donald Sutherland",
        "Ellen Burstyn",
        "Federico Fellini"
      ],
      "genres": [
        "Comedy",
        "Drama"
      ],
      "href": "Alex_in_Wonderland",
      "extract": "Alex in Wonderland is a 1970 American comedy-drama film directed by Paul Mazursky, written with his partner Larry Tucker, starring Donald Sutherland and Ellen Burstyn. Sutherland plays Alex Morrison, a director agonizing over the choice of follow-up project after the success of his first feature film. The situation is similar to the one Mazursky found himself in following the success of Bob & Carol & Ted & Alice (1969) and he casts himself in a role as a new-style Hollywood producer. His daughter Meg Mazursky appears as Amy, one of Morrison's daughters. Noted teacher of improvisational theater Viola Spolin plays Morrison's mother. The film also features cameo appearances by Federico Fellini and Jeanne Moreau, and seems to be inspired by their work. In particular, Fellini's 8½ (1963), about a film director who's artistically stuck, is referenced. Moreau sings two songs on the soundtrack, \"Le Vrai Scandale\" and \"Le Reve Est La.\"",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/19/Alex_in_Wonderland_FilmPoster.jpeg",
      "thumbnail_width": 257,
      "thumbnail_height": 386
    },
    {
      "title": "The Angel Levine",
      "year": 1970,
      "cast": [
        "Zero Mostel",
        "Harry Belafonte",
        "Ida Kamińska"
      ],
      "genres": [
        "Drama"
      ],
      "href": "The_Angel_Levine",
      "extract": "The Angel Levine is a 1970 American drama film directed by Ján Kadár and starring Zero Mostel, Harry Belafonte, Ida Kamińska, Milo O'Shea, and Gloria Foster. It is based on a short story by Bernard Malamud about Morris Mishkin, an elderly, impoverished New York City tailor who becomes unable to work due to health problems. His wife has also been seriously ill for two years, and their situation is now desperate. The tailor's Jewish faith, or lack of it, is challenged when a man calling himself Alexander Levine enters his life, claiming to be his guardian angel. Levine says that he must make the tailor believe in his mission, or fail to earn his angelic wings."
    },
    {
      "title": "Angel Unchained",
      "year": 1970,
      "cast": [
        "Larry Bishop",
        "Tyne Daly",
        "Aldo Ray"
      ],
      "genres": [
        "Drama",
        "Action",
        "Thriller"
      ],
      "href": "Angel_Unchained",
      "extract": "Angel Unchained is a 1970 American action thriller film directed by Lee Madden for American International Pictures and starring Don Stroud as the title character Angel. It was released in the United States on September 2, 1970.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/thumb/4/4e/Angel_Unchained_1970_poster.jpg/320px-Angel_Unchained_1970_poster.jpg",
      "thumbnail_width": 320,
      "thumbnail_height": 252
    },
    {
      "title": "The Aristocats",
      "year": 1970,
      "cast": [
        "Phil Harris",
        "Eva Gabor",
        "Gary Dubin"
      ],
      "genres": [
        "Animated",
        "Comedy",
        "Musical",
        "Romance"
      ],
      "href": "The_Aristocats",
      "extract": "The Aristocats is a 1970 American animated romantic musical comedy film produced by Walt Disney Productions and directed by Wolfgang Reitherman. It is the final Disney animated film to be involved with Walt Disney Productions's co-founder Roy O. Disney before his death on December 20, 1971. The 20th Disney animated feature film, the film is based on a story by Tom McGowan and Tom Rowe, and revolves around a family of aristocratic cats, and how an alley cat acquaintance helps them after a butler has kidnapped them to gain his mistress's fortune which was intended to go to them. The film features the voices of Phil Harris, Eva Gabor, Hermione Baddeley, Dean Clark, Sterling Holloway, Scatman Crothers, and Roddy Maude-Roxby.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/8d/Aristoposter.jpg",
      "thumbnail_width": 256,
      "thumbnail_height": 389
    },
    {
      "title": "The Baby Maker",
      "year": 1970,
      "cast": [
        "Barbara Hershey",
        "Collin Wilcox Paxton",
        "Scott Glenn"
      ],
      "genres": [
        "Drama"
      ],
      "href": "The_Baby_Maker",
      "extract": "The Baby Maker is a 1970 American drama film that was directed and co-written by James Bridges and released by National General Pictures.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/2/2a/The_Baby_Maker_%281970%29_poster.jpg",
      "thumbnail_width": 251,
      "thumbnail_height": 385
    },
    {
      "title": "The Ballad of Cable Hogue",
      "year": 1970,
      "cast": [
        "Jason Robards",
        "Stella Stevens",
        "David Warner"
      ],
      "genres": [
        "Western",
        "Comedy"
      ],
      "href": "The_Ballad_of_Cable_Hogue",
      "extract": "The Ballad of Cable Hogue is a 1970 American Technicolor Western comedy film directed by Sam Peckinpah and starring Jason Robards, Stella Stevens and David Warner. Set in the Arizona desert during a period when the frontier was closing, the film follows three years in the life of a failed prospector. While unmistakably a Western, the movie is unconventional for the genre and for the director. It contains only a few brief scenes of violence and gunplay, relying more on a subtly crafted story that could better be characterized as comedic in nature.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/5/55/Ballad_of_cable_hogue.jpg",
      "thumbnail_width": 259,
      "thumbnail_height": 384
    },
    {
      "title": "Barquero",
      "year": 1970,
      "cast": [
        "Lee Van Cleef",
        "Warren Oates"
      ],
      "genres": [
        "Western",
        "War"
      ],
      "href": "Barquero",
      "extract": "Barquero is a 1970 American Western film starring Lee Van Cleef and Warren Oates directed by Gordon Douglas.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/5/55/Barquero_poster.jpg",
      "thumbnail_width": 260,
      "thumbnail_height": 383
    },
    {
      "title": "Beneath the Planet of the Apes",
      "year": 1970,
      "cast": [
        "James Franciscus",
        "Kim Hunter",
        "Maurice Evans",
        "Linda Harrison"
      ],
      "genres": [
        "Science Fiction"
      ],
      "href": "Beneath_the_Planet_of_the_Apes",
      "extract": "Beneath the Planet of the Apes is a 1970 American science fiction film directed by Ted Post from a screenplay by Paul Dehn, based on a story by Dehn and Mort Abrahams. The film is the sequel to Planet of the Apes (1968) and the second installment in the Planet of the Apes original film series. It stars James Franciscus, Kim Hunter, Maurice Evans, and Linda Harrison, and features Charlton Heston in a supporting role. In the film, another spacecraft arrives on the planet ruled by apes, carrying astronaut Brent (Franciscus), who searches for Taylor (Heston).",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/6/6c/Beneath-the-Planet-of-Apes.jpg",
      "thumbnail_width": 254,
      "thumbnail_height": 392
    },
    {
      "title": "Beyond the Valley of the Dolls",
      "year": 1970,
      "cast": [
        "Cynthia Myers",
        "Dolly Read",
        "Edy Williams"
      ],
      "genres": [
        "Erotic",
        "Comedy",
        "Drama",
        "Musical"
      ],
      "href": "Beyond_the_Valley_of_the_Dolls",
      "extract": "Beyond the Valley of the Dolls is a 1970 American satirical musical melodrama film starring Dolly Read, Cynthia Myers, Marcia McBroom, Phyllis Davis, John LaZar, Michael Blodgett, and David Gurian. The film was directed by Russ Meyer and screenwritten by Roger Ebert from a story by Ebert and Meyer.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/f2/Poster3_beyond_the_valley_of_the_dolls.jpg",
      "thumbnail_width": 220,
      "thumbnail_height": 335
    },
    {
      "title": "Bigfoot",
      "year": 1970,
      "cast": [
        "John Carradine",
        "Joi Lansing",
        "John Mitchum"
      ],
      "genres": [
        "Horror",
        "Independent",
        "Science Fiction"
      ],
      "href": "Bigfoot_(1970_film)",
      "extract": "Bigfoot is a 1970 independently made American low budget science fiction film, produced by Anthony Cardoza and directed by Robert F. Slatzer. The film stars or co-stars a few well-known actors : John Carradine, Chris Mitchum, Joi Lansing, Ken Maynard, Doodles Weaver, and Lindsay Crosby.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/17/Bigfoot1970.jpg",
      "thumbnail_width": 200,
      "thumbnail_height": 264
    },
    {
      "title": "Bloody Mama",
      "year": 1970,
      "cast": [
        "Shelley Winters",
        "Bruce Dern",
        "Don Stroud"
      ],
      "genres": [
        "Crime"
      ],
      "href": "Bloody_Mama",
      "extract": "Bloody Mama is a 1970 American exploitation crime film directed by Roger Corman and starring Shelley Winters in the title role, with Bruce Dern, Don Stroud, Robert Walden, Alex Nicol, and Robert De Niro in supporting roles. It was very loosely based on the real story of Ma Barker, who is depicted as a corrupt, mentally-disturbed mother who encourages and organizes the criminality of her four adult sons in Depression-era southern United States.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/4d/BloodyMama.jpg",
      "thumbnail_width": 257,
      "thumbnail_height": 387
    },
    {
      "title": "The Boatniks",
      "year": 1970,
      "cast": [
        "Robert Morse",
        "Stefanie Powers",
        "Phil Silvers",
        "Norman Fell",
        "Don Ameche"
      ],
      "genres": [
        "Comedy"
      ],
      "href": "The_Boatniks",
      "extract": "The Boatniks is a 1970 American comedy film directed by Norman Tokar and starring Robert Morse, Stefanie Powers, Don Ameche and Phil Silvers. It was made by Walt Disney Productions, released by Buena Vista Distribution.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/b1/Boatniks_movie_poster.jpg",
      "thumbnail_width": 252,
      "thumbnail_height": 396
    },
    {
      "title": "The Boys in the Band",
      "year": 1970,
      "cast": [
        "Kenneth Nelson",
        "Cliff Gorman",
        "Leonard Frey"
      ],
      "genres": [
        "Comedy",
        "Drama"
      ],
      "href": "The_Boys_in_the_Band_(1970_film)",
      "extract": "The Boys in the Band is a 1970 American drama film directed by William Friedkin from a screenplay by Mart Crowley, based on Crowley's 1968 Off-Broadway play of the same name. It is among the early major American motion pictures to revolve around gay characters, often cited as a milestone in the history of queer cinema, and thought to be the first mainstream American film to use the swear word \"cunt\".",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/5/51/The_Boys_in_the_Band-1970_movie_poster.jpg",
      "thumbnail_width": 253,
      "thumbnail_height": 393
    },
    {
      "title": "Brewster McCloud",
      "year": 1970,
      "cast": [
        "Bud Cort",
        "Sally Kellerman",
        "Shelley Duvall"
      ],
      "genres": [
        "Fantasy",
        "Comedy"
      ],
      "href": "Brewster_McCloud",
      "extract": "Brewster McCloud is a 1970 American black comedy film directed by Robert Altman. The film follows a young recluse who lives in a fallout shelter of the Houston Astrodome, where he is building a pair of wings in order to fly. He is helped by his comely and enigmatic \"fairy godmother,\" played by Sally Kellerman, as he becomes a suspect in a series of murders, of which a vain, haughty hot-shot detective lieutenant from San Francisco, played by Michael Murphy, soon becomes hot on his trail.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Brewster_McCloud_%281970_poster%29.jpg/320px-Brewster_McCloud_%281970_poster%29.jpg",
      "thumbnail_width": 320,
      "thumbnail_height": 492
    },
    {
      "title": "A Bullet for Pretty Boy",
      "year": 1970,
      "cast": [
        "Fabian Forte",
        "Jocelyn Lane",
        "Adam Roarke"
      ],
      "genres": [
        "Crime",
        "Action"
      ],
      "href": "A_Bullet_for_Pretty_Boy",
      "extract": "A Bullet for Pretty Boy is a 1970 American action film from director Larry Buchanan. It stars Fabian Forte as gangster Pretty Boy Floyd and co-stars Jocelyn Lane in her final performance before retiring from acting.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/thumb/a/ab/%22A_Bullet_for_Pretty_Boy%22_%281970%29.jpg/320px-%22A_Bullet_for_Pretty_Boy%22_%281970%29.jpg",
      "thumbnail_width": 320,
      "thumbnail_height": 249
    }
  ]